[{"_id":"613f87fa0a6b66001681e820","title":"Side effects & Safety concerns of COVID-19 vaccines","body":"The data from the extensive research, testing, and monitoring in clinical trials, have shown that COVID-19 vaccines are safe & effective in preventing us from getting seriously ill with COVID-19 [1-3]. However, side effects still remain a common issue that is seen nowadays. In this article, we will be highlighting some of the side effects of COVID-19 vaccines (i.e. Pfizer/Moderna vaccine), while also addressing certain safety concerns of the public.\n\nAccording to the World Health Organization, it is common to experience some mild-to-moderate side effects after receiving your vaccinations [1]. This is because your body is initiating an immune response to fight off the injected foreign virus/particles in your body [1]. In particular, for COVID-19 vaccines, some of the common side effects include pain at the injection site, fever, fatigue, headache, muscle pain, nausea, chills, and diarrhea [1-2, 4]. Side effects such as severe allergic reactions (anaphylaxis) can occur; however, this reaction is extremely rare [1,2]. If this occurs, vaccination providers usually have medicines available to immediately treat the allergic reaction [1,2]. After you get a COVID-19 vaccine, you will be asked to stay for 15–30 minutes so you can be closely watched in case you develop a severe allergic reaction and need immediate treatment [1,2].\n\nSome members of the public may be also concerned with the long-term side effects of COVID-19 vaccines. According to the Centers for Disease Control and Prevention (CDC), it is mentioned that long-term side effects are unlikely following any vaccination, including the COVID-19 vaccination [2, 11]. Historically, vaccine monitoring has shown that side effects generally happen within six weeks of receiving a vaccine dose [2, 11]. To add on, millions of people have already received their COVID-19 vaccinations, and to date, no long-term side effects have been detected [2].\n\nAlso, reputable healthcare organizations like the CDC are closely monitoring the safety profiles of the vaccines. In the event that scientists find a link between a safety issue and a vaccine, FDA and the vaccine manufacturer will work to find an appropriate solution to resolve the specific safety concern [2].\n\nOther members of the public may have other concerns such as whether if it's safe to administer COVID-19 vaccines in women who are pregnant or breastfeeding. International healthcare organizations such as the World Health Organization, Centers for Disease Control and Prevention, and the Ministry of Health in Singapore, states that both pregnant or breast-feeding women can be vaccinated with the Pfizer-BioNTech or Moderna COVID-19 vaccine [5-10], especially since the known benefits of the COVID-19 vaccine outweigh the potential risks. For other types/brands of COVID-19 vaccines, if you are pregnant/breastfeeding, please check with your healthcare provider first to determine if you are suitable/eligible to take the vaccine.\n\nFor more information, regarding the use of COVID-19 vaccines, you can refer to the following videos by the World Health Organization: https://www.youtube.com/watch?v=B8Mb-zPltG8&t=205s\nhttps://www.youtube.com/watch?v=w9sxA1rJoFY\n\nReferences:\n[1] World Health Organization. Link: https://www.who.int/news-room/feature-stories/detail/side-effects-of-covid-19-vaccines\n[2] Centers for Disease Control and Prevention. Link: https://www.cdc.gov/coronavirus/2019-ncov/vaccines/safety/safety-of-vaccines.html\n[3] Centers for Disease Control and Prevention. Link: https://www.cdc.gov/coronavirus/2019-ncov/vaccines/vaccine-benefits.html\n[4] Ministry of Health Singapore. Link: https://www.moh.gov.sg/covid-19/vaccination/faqs---post-vaccination-matters\n[5] Ministry of Health Singapore. Link: https://www.moh.gov.sg/news-highlights/details/expert-committee-on-covid-19-vaccination-expands-medical-eligibility-for-mrna-vaccines\n[6] KK Women's and Children's Hospital. Link: https://www.kkh.com.sg/patient-care/areas-of-care/covid19-vaccination-and-breastfeeding\n[7] World Health Organization. Link: https://www.who.int/news-room/feature-stories/detail/who-can-take-the-pfizer-biontech-covid-19--vaccine\n[8] World Health Organization. Link: https://www.who.int/news-room/feature-stories/detail/the-moderna-covid-19-mrna-1273-vaccine-what-you-need-to-know\n[9] HealthXchange.sg (SingHealth). Link: https://www.healthxchange.sg/medicine-first-aid/medicine/covid-19-vaccine-safe-for-pregnancy-breastfeeding\n[10] Centers for Disease Control and Prevention. Link: https://www.cdc.gov/coronavirus/2019-ncov/vaccines/recommendations/pregnancy.html\n[11] Centers for Disease Control and Prevention. Link: https://www.cdc.gov/coronavirus/2019-ncov/vaccines/expect/after.html","authorName":"Melvin Ng","postDate":"2021-09-13T17:18:50.076Z","__v":0},{"_id":"613eb29a76377400161c6f83","title":"Explaining the different types/brands of COVID-19 vaccines","body":"There are several brands/types of COVID-19 vaccines produced by different pharmaceutical companies globally. In this article, we will be discussing some of the different types/brands of COVID-19 vaccines available in the market, while focusing on two main brands - the Pfizer-BioNTech COVID-19 vaccine & the Moderna vaccine, which are authorized and approved for use in countries like the United States [1] and Singapore [2].\r\n\r\nIn general, there are several different types/brands of COVID-19 vaccines. They are [1-5]:\r\na) mRNA vaccines - Pfizer-BioNTech/ Comirnaty, Moderna\r\nb) Protein subunit vaccines - Novavax\r\nc) Viral vector vaccines - Johnson & Johnson’s Janssen, Astra-Zeneca\r\nd) Inactivated virus vaccines - Sinovac, Sinopharm\r\n\r\nAmong the list of vaccines above, two of these vaccines - namely the mRNA vaccines (Pfizer & Moderna), are approved for use both in the United States and Singapore [1,2]. Below is a detailed summary of additional information regarding these two brands of mRNA vaccines and in addition, the Johnson & Johnson’s Janssen COVID-19 vaccine [1-2, 6]:\r\n\r\n- Pfizer-BioNTech COVID-19 vaccine: *For ages 12 years & older.  **Two shots to be given 3 weeks (21 days) apart. To be considered fully vaccinated, you have to wait 2 weeks after your second shot.\r\n- Moderna COVID-19 vaccine: *For ages 18 years & older. **Two shots to be given 4 weeks (28 days) apart. To be considered fully vaccinated, you will have to wait 2 weeks after your second shot.\r\n- Johnson & Johnson’s Janssen COVID-19 vaccine: ***For ages 18 years & older. 1 shot to be given only. To be considered fully vaccinated, you will have to wait 2 weeks after your shot. \r\n\r\n* If you have had a severe allergic reaction (anaphylaxis) or an immediate allergic reaction to any ingredient or excipient in the vaccine you are scheduled to receive, you should not get that vaccine. If you have been instructed not to get one type of COVID-19 vaccine, you may still be able to get another type, if available [1,2]. Consult your healthcare provider regarding your medical eligibility for taking the vaccine and for more information.\r\n** You should get your second shot as close to the recommended 3-week or 4-week interval as possible. However, your second shot may be given up to 6 weeks (42 days) after the first dose, if necessary [1,6].\r\n*** As of this time in writing, the J&J vaccine is currently not available in Singapore. However, it is available and authorized for use in the United States as of this time in writing.\r\n\r\nReferences:\r\n[1] Centers for Disease Control and Prevention. Link: https://www.cdc.gov/coronavirus/2019-ncov/vaccines/different-vaccines.html\r\n[2] Ministry of Health Singapore. Link: https://www.moh.gov.sg/covid-19/vaccination/faqs---safety-and-efficacy-of-the-covid-19-vaccine\r\n[3] Ministry of Health Singapore. Link: https://www.moh.gov.sg/covid-19/vaccination/faqs---general-information-on-covid-19-vaccines\r\n[4] World Health Organization. Link: https://www.who.int/publications/m/item/sinopharm-vero-cell---inactivated-covid-19-vaccine\r\n[5] World Health Organization. Link: https://extranet.who.int/pqweb/sites/default/files/documents/Status_COVID_VAX_19August2021.pdf\r\n[6] Centers for Disease Control and Prevention. Link: https://www.cdc.gov/coronavirus/2019-ncov/vaccines/second-shot.html","authorName":"Melvin Ng","postDate":"2021-09-13T02:08:26.081Z","__v":0},{"_id":"605c1fc14bc4af0015aaa68f","title":"Prevention of COVID-19 infection","body":"So, having mentioned earlier the basics about COVID-19, how exactly we do prevent the spread of the disease?\r\n\r\nAccording to the World Health Organization and Centers for Disease Control and Prevention, they recommend the following [1,2]:\r\n1) Maintain personal hygiene by washing your hands regularly with soap and water, or by cleaning them with alcohol-based hand sanitizers.\r\n2) Avoid touching your face, as pathogens like viruses can be picked up by our hands and get into the body through mucous membranes on the face — eyes, nose, and mouth.\r\n3) Avoid unnecessary travel and staying away from large crowds and poorly ventilated spaces.\r\n4) Wear a mask if traveling outside.\r\n5) Practice social distancing by maintaining at least 1 metre distance apart between you and other people.\r\n6) When coughing or sneezing, cover your mouth and nose. \r\n7) If unwell, stay at home.\r\n\r\nWith this piece of information available, let us all do part to help prevent the spread of COVID-19 by adhering to the recommended suggestions above!\r\n\r\nReferences:\r\n[1] World Health Organization. Link: https://www.who.int/health-topics/coronavirus#tab=tab_2\r\n[2] Centers for Disease Control and Prevention. Link: https://www.cdc.gov/coronavirus/2019-ncov/prevent-getting-sick/prevention.html","authorName":"Melvin Ng","postDate":"2021-03-25T05:29:37.539Z","__v":0},{"_id":"605ad60b78d1010015f1337f","title":"What is COVID-19?","body":"COVID-19, or commonly known as Coronavirus Disease, is an infectious disease that's caused by a novel coronavirus [1]. As of now, there are multiple variants of the virus, of which, notable ones include the variant identified in the U.K. (B.1.1.7), the variant identified in South Africa (B.1.351), the variant identified in Japan/Brazil (P.1) and the variants identified in the U.S. (California) (B.1.427 & B.1.429) [2,3].\r\n\r\nAccording to the World Health Organization, most people infected with the COVID-19 disease will experience mild to moderate respiratory illness and recover without requiring special treatment [1]. Some of the most common symptoms of COVID-19 include (but not limited to) fever, dry cough, tiredness, chills, headache, sore throat, loss of appetite, and loss of smell [1, 4]. COVID-19 may also cause more serious symptoms such as high fever, severe cough, shortness of breath [4]. If such severe symptoms are present together, it often indicates the presence of pneumonia as well [4]. After contracting the virus, on average, it takes 5-6 days for symptoms to show in the infected individual [1]. In some individuals, however, it can take up to 14 days for them to display symptoms [1]. In general, if you are suffering from any of the symptoms as mentioned above, please seek medical attention & consult the advice of your physician.\r\n\r\nReferences:\r\n[1] World Health Organization. Link: https://www.who.int/health-topics/coronavirus#tab=tab_1\r\n[2] Mayoclinic. Link: https://www.mayoclinic.org/diseases-conditions/coronavirus/expert-answers/covid-variant/faq-20505779\r\n[3] Centers for Disease Control and Prevention. Link: https://www.cdc.gov/coronavirus/2019-ncov/more/science-and-research/scientific-brief-emerging-variants.html\r\n[4] Harvard Health Publishing. Link: https://www.health.harvard.edu/diseases-and-conditions/covid-19-basics\r\n","authorName":"Melvin Ng","postDate":"2021-03-24T06:02:51.370Z","__v":0},{"_id":"605dbfd458c0a60015c23808","title":"Debunking COVID-19 Myths/Rumors","body":"As a healthcare professional, I sometimes receive COVID-19 myths/rumors which are not only factually inaccurate but also not evidence-based as well. Hence, I would like to clarify/debunk some of the COVID-19 myths/rumors which I've heard:\r\n\r\nMyth 1: COVID-19 was deliberately created or released by people.\r\nResponse to Myth 1: This is false. According to an article by Johns Hopkins Medicine [1], viruses can change over time, and occasionally a virus that is common in animals, may undergo mutations and then passes to humans. This is most likely the origin of the current coronavirus. To further support this view, a research paper titled 'The proximal origin of SARS-CoV-2' published in the prestigious journal Nature Medicine, mentions that the COVID-19 virus \"is not a laboratory construct or a purposefully manipulated virus\" [2]. The paper also summarizes that animals such as bats are likely the source of the COVID-19 virus [2]. Further evidence in another research paper published in a highly-regarded and peer-reviewed journal, Nature Communications, found evidence for SARS-CoV-2 related coronaviruses circulating in bats and pangolins in Southeast Asia [3].\r\n\r\nMyth 2: Garlic, Vitamins, and Mineral supplements can prevent COVID-19.\r\nResponse to Myth 2: This is also false. Although garlic is a health food that may have some antimicrobial properties, however, there is no evidence that the consumption of garlic can help prevent COVID-19 [4]. Likewise, vitamins (e.g. C & D) and minerals such as zinc, are important micro-nutrients for maintaining a well-functioning immune system. However, as of now, there is no medical guidance/guidelines on the use of such micronutrient supplements as a treatment of COVID-19 [4].\r\n\r\nMyth 3: Hot showers can prevent COVID-19.\r\nResponse to Myth 3: This is also false. There is no evidence that taking hot showers can prevent COVID-19 infection. Instead, taking hot showers with extremely hot water, may be even detrimental as the hot water may burn you [4]. Instead, the World Health Organization recommends frequently cleaning your hands with soap & water, to protect yourself against COVID-19 [4].\r\n\r\nReferences:\r\n[1] Johns Hopkins Medicine. Link: https://www.hopkinsmedicine.org/health/conditions-and-diseases/coronavirus/2019-novel-coronavirus-myth-versus-fact\r\n[2] Nature Medicine. Andersen, K.G., Rambaut, A., Lipkin, W.I. et al. The proximal origin of SARS-CoV-2. Nat Med 26, 450–452 (2020). https://doi.org/10.1038/s41591-020-0820-9\r\n[3] Nature Communications. Wacharapluesadee, S., Tan, C.W., Maneeorn, P. et al. Evidence for SARS-CoV-2 related coronaviruses circulating in bats and pangolins in Southeast Asia. Nat Commun 12, 972 (2021). https://doi.org/10.1038/s41467-021-21240-1\r\n[4] World Health Organization. Link: https://www.who.int/emergencies/diseases/novel-coronavirus-2019/advice-for-public/myth-busters","authorName":"Melvin Ng","postDate":"2021-03-26T11:04:52.257Z","__v":0},{"_id":"613e201f5179860016d16b0d","title":"A general overview of vaccines","body":"Many countries have been steadily encouraging their citizens to go for their COVID-19 vaccination jabs. As you head to the clinic, mobile vaccination center, or hospital for that COVID-19 vaccine, have you stopped and wondered exactly how do these vaccines work? And also, what are the different types of vaccines?\r\n\r\nIn this article, I will be giving a general overview of the different types of vaccines. Take note, this is not limited to just COVID-19 vaccines; other vaccines will also be mentioned in this article. This article is meant to provide a general understanding of the different types of vaccines to the public.\r\n\r\nTo start off, there are generally three different broad categories of vaccines [1,2]:\r\n- The first type of vaccine would use a whole virus/bacterium. \r\n- The second type of vaccine would use only parts of the microbe that trigger the immune system. \r\n- The third type of vaccine would only use the genetic material of the virus/bacterium.\r\n\r\nTo go into specifics, the first type of vaccine (whole virus/bacterium), can be further divided into various other sub-categories [1,2]:\r\n- Inactivated vaccine: The disease-carrying virus/bacterium is inactivated/killed using chemicals, heat, or radiation. Examples of such vaccines include flu vaccines and polio vaccines.\r\n- Live attenuated vaccine: A living but weakened version of the virus or one that's similar is used here. Examples of such vaccines in this sub-category include the measles, mumps, and rubella (MMR) vaccine and the chickenpox and shingles vaccine. \r\n- Viral vector vaccine: A harmless virus is altered and used as a vector to contain the viral genetic code. The viral vector then transports the genetic code to the cell, which will eventually be used to form proteins. These proteins trigger and build up our immune response. An example of such a vaccine would be Johnson & Johnson’s Janssen COVID-19 vaccine [2].\r\n\r\nThe second type of vaccine uses only certain parts of the virus/bacteria that trigger the immune system [1,2]. These are also commonly known as subunit vaccines [1,2]. These subunits can be proteins or sugars which the immune system recognizes. Examples of vaccines in this second category are the DTaP (Diphtheria, Tetanus, and Pertussis) vaccine, the Meningococcal vaccine, and the Pneumococcal vaccines [1,3].\r\n\r\nThe third type of vaccine uses only the genetic material of the disease-causing virus/bacteria [1,2]. These are also known as nucleic acid vaccines [1,2]. They deliver a set of genetic instructions to the cells in the body to eventually make certain proteins that we want our immune system to recognize, respond to and then build up our immunity from [1,2]. Examples of such vaccines include Pfizer-BioNTech COVID-19 Vaccine and the Moderna COVID-19 Vaccine. Both of these two vaccines contain mRNA (messenger RNA), which the body will use to make a protein or a piece of protein that triggers the immune response inside our bodies [2].\r\n\r\nSources:\r\n[1] World Health Organization. Link: https://www.who.int/news-room/feature-stories/detail/the-race-for-a-covid-19-vaccine-explained\r\n[2] Centers for Disease Control and Prevention. Link: https://www.cdc.gov/coronavirus/2019-ncov/vaccines/different-vaccines/how-they-work.html\r\n[3] Centers for Disease Control and Prevention.  Link: https://www.cdc.gov/vaccines/pubs/pinkbook/downloads/prinvac.pdf","authorName":"Melvin Ng","postDate":"2021-09-12T15:43:27.547Z","__v":0}]